/**********************************
* 砝码称重
* 题目描述：
* 设有1g、2g、3g、5g、10g、20g的砝码各若干枚（其总重<=1000），求用这些砝码能称出不同的重量个数。
*
* 输入：
* 1g、2g、3g、5g、10g、20g的砝码个数。
*
* 输出：
* 输出能称出不同重量的个数。
*
* 思路：（枚举法）
* 根据输入的砝码信息，每种砝码可用的最大个数是确定的，而且每种砝码的个数是连续的，能取0到最大个数，所以符合枚举法
* 的两个条件，可以使用枚举法。枚举时，重量可以由1g,2g,……,20g砝码中的任何一个或者多个构成，枚举对象可以确定为6种重量的砝码，
* 范围为每种砝码的个数。判定时，只需判断这次得到的重量是新得到的，还是前一次已经得到的，即判重。
* 由于重量<=1000g，所以，可以开一个a[1001]的数组来判重。
*
*
* 作者：jay.xu
* 日期：2019-07-17
*
********************************/

#include <stdio.h>

int A[1001]={0};

void weightA(void)
{
    int a=8, b=9, c=10, d=11, e=12, f=13, i, sum, num;
    int arr[7];
    int w[7]={0,1,2,3,5,10,20};

    printf("输入6种砝码的个数, 以空格隔开: \n");

    while(scanf("%d%d%d%d%d%d", &a, &b, &c, &d, &e, &f) != EOF)
    {
        for(arr[1] = 0; arr[1] <= a; arr[1]++)
            for(arr[2] = 0; arr[2] <= b; arr[2]++)
                for(arr[3] = 0; arr[3] <= c; arr[3]++)
                    for(arr[4] = 0; arr[4] <= d; arr[4]++)
                        for(arr[5] = 0; arr[5] <= e; arr[5]++)
                            for(arr[6] = 0; arr[6] <= f; arr[6]++)
                            {
                                sum = 0;
                                for(i = 1; i <= 6; i++)
                                {
                                    sum += arr[i] * w[i];
                                    A[sum] = 1;
                                }
                            }
        num = 0;
        for(i = 1; i <= 1000; i++)
        {
            if(A[i] == 1)
                num++;
        }
        printf("Total = %d\n\n", num);
        printf("输入6种砝码的个数, 以空格隔开: \n");
    }
}


void weightB(void)
{
    int a[6], m[6], total = 0, i, j, k, f[1001];
    for(i = 0; i <= 1000; i++)
        f[i] = 0;
    f[0] = 1;

    m[0] = 1;
    m[1] = 2;
    m[2] = 3;
    m[3] = 5;
    m[4] = 10;
    m[5] = 20;
    for(i = 0; i < 6; i++)
        scanf("%d", &a[i]);
    for(i = 0; i < 6; i++)
    {
        for (j = 0; j < a[i]; j++)
        {
            for (k = 1000; k >= m[i]; k--)
                if (f[k - m[i]] && !f[k])
                {
                    f[k] = 1;
                    total++;
                }
        }
    }
    printf("Total = %d\n", total);
}

int main(void)
{
    weightA();

    return 0;
}
